# Mit Pandas mehr aus den Daten herausholen
## Pandas
* Pandas ist ein neueres Paket, das auf NumPy aufbaut.
* NumPy ist sehr nützlich für numerische Berechnungen.
* Pandas bietet mehr Flexibilität: Anbringen von Beschriftungen an Daten, Arbeiten mit fehlenden Daten, usw.

In [31]:
import pandas as pd
pd.__version__

'2.0.3'

In [32]:
import numpy as np # We will need NumPy throughout this course day
np.__version__

'1.25.0'

## Die Pandas - Objekte
* Pandas-Objekte sind erweiterte Versionen von NumPy-Arrays: Die Zeilen und Spalten werden mit Beschriftungen anstelle von einfachen Integer-Indizes identifiziert
* `Series` object: Ein eindimensionales Array mit indizierten Daten
* `DataFrame` object: Ein zweidimensionales Array mit sowohl flexiblen Zeilenindizes als auch flexiblen Spaltennamen

## The Pandas `Series` Object
* Ein Pandas `Series` Objekt ist ein eindimensionales Array mit indizierten Daten
 * NumPy-Array: hat einen _implizit_ definierten Integer-Index
 * Ein "Series"-Objekt verwendet standardmäßig Integer-Indizes:

In [3]:
data1 = pd.Series([100,200,300])
data1

0    100
1    200
2    300
dtype: int64

* Ein `Series`-Objekt kann einen _explizit_ definierten Index haben, der mit den Werten verbunden ist:

In [4]:
data2 = pd.Series([100,200,300], index=["a","b","c"])
data2

a    100
b    200
c    300
dtype: int64

* Wir können auf die Indexbezeichnungen mit dem Attribut `index` zugreifen:

In [5]:
d2ind = data2.index
d2ind

Index(['a', 'b', 'c'], dtype='object')

* Ein Python-dictionary bildet beliebige Schlüssel auf eine Menge beliebiger Werte ab.
* Ein "Series"-Objekt bildet _typisierte_ Schlüssel auf eine Menge von _typisierten_ Werten ab.
 * Typisiert" bedeutet, dass wir den Typ der Indizes und Elemente im Voraus kennen, was Pandas Serienobjekte für bestimmte Operationen viel effizienter macht als Python-dictionaries
* Wir können ein "Series"-Objekt direkt aus einem Python-Wörterbuch konstruieren:

In [6]:
data_dict = pd.Series({"c":123,"a":30,"b":100})
data_dict

c    123
a     30
b    100
dtype: int64

* _Hinweis_: Der Index für die `Series` wird aus den sortierten Schlüsseln gezogen

## The Pandas `DataFrame` Object
* A `DataFrame`-Objekt ist ein Analogon zu einem zweidimensionalen Array mit flexiblen Zeilenindizes und flexiblen Spaltennamen.
 * Sowohl die Zeilen als auch die Spalten haben einen generalisierten Index für den Zugriff auf die Daten.
 * Auf die Zeilenindizes kann mit dem Attribut `index` zugegriffen werden.
 * Auf die Spaltenindizes kann mit dem Attribut `Spalten` zugegriffen werden.
 
## Ein `DataFrame` Objekt Konstruieren
* Man kann sich einen `DataFrame` als eine Folge von ausgerichteten `Series`-Objekten vorstellen, was bedeutet, dass jede Spalte eines `DataFrame` eine `Series` ist.

In [6]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135,
                    'Alabama': 232323232}
population = pd.Series(population_dict)

area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)

In [15]:
population

California     38332521
Texas          26448193
New York       19651127
Florida        19552860
Illinois       12882135
Alabama       232323232
dtype: int64

In [16]:
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [13]:
states = pd.DataFrame({'population': population,'area': area})
states

            population      area
Alabama      232323232       NaN
California    38332521  423967.0
Florida       19552860  170312.0
Illinois      12882135  149995.0
New York      19651127  141297.0
Texas         26448193  695662.0

In [11]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [12]:
states.columns

Index(['population', 'area'], dtype='object')

* Es gibt mehrere Möglichkeiten, ein `DataFrame`-Objekt zu konstruieren
 * Aus einem einzelnen `Series`-Objekt

In [18]:
pd.DataFrame({'popp': population,'aaa': area})

                 popp       aaa
Alabama     232323232       NaN
California   38332521  423967.0
Florida      19552860  170312.0
Illinois     12882135  149995.0
New York     19651127  141297.0
Texas        26448193  695662.0

* Aus einer Liste von dictionaries:

In [14]:
x = pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])
print(x)
value = 3

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

* Aus einem dictionary von `Series`-Objekten:

In [15]:
pd.DataFrame({'population': population, 'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

* Aus einem zweidimensionalen NumPy-Array:

In [33]:
rng = np.random.RandomState(0) # Ensure that the same random numbers are generated each time we run this code
pd.DataFrame(rng.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.548814  0.715189
b  0.602763  0.544883
c  0.423655  0.645894

## Data Selection in `Series`

`Series` als dictionary:
 * Elemente nach Schlüssel auswählen, z.B. `Daten['a']`
 * Ändern Sie das Objekt "Serie" mit der bekannten Syntax, z. B. "Daten['e'] = 100".
 * Prüfen, ob ein Schlüssel existiert, indem man den Operator "in" verwendet
 * Zugriff auf alle Schlüssel mit Hilfe der Methode `keys()`.
 * Zugriff auf alle Werte mit der Methode `items()`.

In [20]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [18]:
data['b']

0.5

In [19]:
'a' in data

True

In [20]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [38]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [22]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

* `Series` als eindimensionales Array:
 * Auswahl der Elemente durch den impliziten Integer-Index, z.B. `data[0]`
 * Auswahl von Elementen durch den expliziten Index, z.B. `data['a']`
 * Auswahl von Slices (mit Hilfe eines impliziten ganzzahligen Index oder eines expliziten Index)
   * _Wichtig_: Beim Slicen mit einem expliziten Index (z.B. `data['a':'c']`) wird der letzte Index in das Slice _eingeschlossen_, während beim Slicen mit einem impliziten Index (z.B. `data[0:3]`) der letzte Index aus dem Slice _ausgeschlossen_ wird
 * Maskierungsoperationen verwenden, z.B. `data[data < 3]`

In [23]:
data['a':'c'] # Slicing by explicit index

a    0.25
b    0.50
c    0.75
dtype: float64

In [24]:
data[0:2] # Slicing by implicit index

a    0.25
b    0.50
dtype: float64

In [25]:
data[(data > 0.3) & (data < 0.8)] # Masking operation

b    0.50
c    0.75
dtype: float64

## Data Selection in `DataFrame`
* `DataFrame` als ein Wörterbuch von verwandten `Series` Objekten:
 * Wählen Sie `Series` über den Spaltennamen aus, z.B. `df['area']`
 * Ändern Sie das `DataFrame`-Objekt mit der bekannten Syntax, z.B. `df['c3'] = df['c2']/ df['c1']`

In [22]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})

population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127, 'Florida': 19552860,
                        'Illinois': 12882135})

data = pd.DataFrame({'area': area, 'population': population})
data

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [27]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [28]:
data['density'] = data['population'] / data['area']
data

              area  population     density
California  423967    38332521   90.413926
Texas       695662    26448193   38.018740
New York    141297    19651127  139.076746
Florida     170312    19552860  114.806121
Illinois    149995    12882135   85.883763

* `DataFrame` als zweidimensionales Array:
 * Zugriff auf das zugrundeliegende NumPy-Datenarray durch Verwendung des Attributs `values`
   * `df.values[0]` wird die erste Zeile auswählen
 * Verwenden Sie den Indexer `iloc`, um die Daten zu indizieren, aufzuschlitzen und zu verändern, indem Sie den impliziten Integer-Index verwenden.
 * Verwenden Sie den `loc`-Indexer, um die Daten mit Hilfe des expliziten Indexes zu indizieren, aufzuschlitzen und zu verändern.

In [29]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [30]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [23]:
data.iloc[0:3, 0:2] # Use implicit indices

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127

In [24]:
data.loc[:'Illinois', :'population'] # Use explicit indices

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [ ]:
data.iloc[0, 2] = 90
data

## Ufuncs and Pandas
* Pandas ist für die Zusammenarbeit mit Numpy konzipiert, daher funktioniert jede NumPy-ufunc mit Pandas Series- und `DataFrame`-Objekten
* _Index-Erhaltung_: Indizes bleiben erhalten, wenn ein neues Pandas-Objekt nach der Anwendung von ufuncs herauskommt
* _Index-Ausrichtung_: Pandas richtet Indizes während der Durchführung einer Operation aus
 * Fehlende Daten werden mit `NaN` ("Not a Number") markiert
 * Mit dem optionalen Schlüsselwort fill_value kann angegeben werden, wie die fehlenden Elemente aufgefüllt werden sollen: `A.add(B, fill_value=0)`
 * Wir können auch die Methode `dropna()` verwenden, um fehlende Werte zu löschen
* _Hinweis_: Jeder der für NumPy besprochenen ufuncs kann in ähnlicher Weise mit Pandas-Objekten verwendet werden

### Ufuncs: Index Preservation

In [34]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [35]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [ ]:
np.exp(ser)

In [ ]:
np.sin(df * np.pi / 4)

### Ufuncs: Index Alignment

In [25]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')

population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [26]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [50]:
(population / area).dropna()

In [36]:
test = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('AB'))
test

   A   B
0  1  11
1  5   1

In [37]:
test2 = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
test2

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [38]:
test + test2

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [39]:
test.add(test2, fill_value=0)

      A     B    C
0   1.0  15.0  9.0
1  13.0   6.0  0.0
2   2.0   9.0  6.0

## Ufuncs: Operationen zwischen DataFrame und Series
* Operationen zwischen einem `DataFrame` und einer `Series` sind ähnlich wie Operationen zwischen einem zweidimensionalen und einem eindimensionalen NumPy-Array (z.B. Berechnung der Differenz zwischen einem zweidimensionalen Array und einer seiner Zeilen)

In [40]:
rng = np.random.RandomState(2)
A = rng.randint(10, size=(3, 4))
A

array([[8, 8, 6, 2],
       [8, 7, 2, 1],
       [5, 4, 4, 5]])

In [41]:
A - A[0] # Subtract the first row of A from A itself

array([[ 0,  0,  0,  0],
       [ 0, -1, -4, -1],
       [-3, -4, -2,  3]])

In [42]:
B = rng.randint(10, size=(3, 4))
B

array([[7, 3, 6, 4],
       [3, 7, 6, 1],
       [3, 5, 8, 4]])

In [43]:
df = pd.DataFrame(B, columns=list('QRST'))
df

   Q  R  S  T
0  7  3  6  4
1  3  7  6  1
2  3  5  8  4

In [44]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -4  4  0 -3
2 -4  2  2  0

In [51]:
df.subtract(df['R'], axis=0) # We can also subtract column-wise

   Q  R  S  T
0  4  0  3  1
1 -4  0 -1 -6
2 -2  0  3 -1

## Lesen und Schreiben von Daten mit Pandas
### Datei-Typen
* Wir werden in dieser Sitzung nur mit _Klartextdateien_ arbeiten; diese enthalten nur einfache Textzeichen und keine Schriftart-, Größen- oder Farbinformationen
 * _Binärdateien_ sind alle anderen Dateitypen, wie PDFs, Bilder, ausführbare Programme usw.
 
### Das aktuelle Arbeitsverzeichnis
* Jedes Programm, das auf Ihrem Computer läuft, hat ein _aktuelles Arbeitsverzeichnis_.
 * Es ist das Verzeichnis, von dem aus das Programm ausgeführt wird.
 * _Ordner_ ist die modernere Bezeichnung für ein Verzeichnis.
* Das _Wurzelverzeichnis_ ist das oberste Verzeichnis und wird mit `/` angesprochen.
 * Ein Verzeichnis `mydir1` im Wurzelverzeichnis kann mit `/mydir1` angesprochen werden
 * Ein Verzeichnis `mydir2` innerhalb des Verzeichnisses `mydir1` kann mit `/mydir/mydir2` adressiert werden, und so weiter
 
### Absolute und relative Pfade
* Ein _absoluter Pfad_ beginnt immer mit dem Stammverzeichnis, z.B. `/my/path/...`
* Ein _relativer Pfad_ ist immer relativ zum aktuellen Arbeitsverzeichnis des Programms.
 * Wenn das aktuelle Arbeitsverzeichnis eines Programms `/myprogram` ist und das Verzeichnis einen Ordner files mit einer Datei `test.txt` enthält, dann ist der relative Pfad zu dieser Datei einfach `files/test.txt`
 * Der absolute Pfad zu `test.txt` wäre `/myprogram/files/test.txt` (beachten Sie den Stammordner `/`)

In [ ]:
!ls # List folder content / for windows use !dir
!pwd # current working directory

### Reading Data mit Pandas
* Pandas offeriert `pandas.read_csv()` Funktion zum Laden von Daten aus einer CSV-Datei (oder einer Datei, die ein anderes Trennzeichen als ein Komma verwendet)

In [53]:
planets = pd.read_csv("planets.csv")

In [54]:
planets.shape

(1035, 6)

In [57]:
planets.head(20)

             method  number  orbital_period    mass  distance  year
0   Radial Velocity       1      269.300000   7.100     77.40  2006
1   Radial Velocity       1      874.774000   2.210     56.95  2008
2   Radial Velocity       1      763.000000   2.600     19.84  2011
3   Radial Velocity       1      326.030000  19.400    110.62  2007
4   Radial Velocity       1      516.220000  10.500    119.47  2009
5   Radial Velocity       1      185.840000   4.800     76.39  2008
6   Radial Velocity       1     1773.400000   4.640     18.15  2002
7   Radial Velocity       1      798.500000     NaN     21.41  1996
8   Radial Velocity       1      993.300000  10.300     73.10  2008
9   Radial Velocity       2      452.800000   1.990     74.79  2010
10  Radial Velocity       2      883.000000   0.860     74.79  2010
11  Radial Velocity       1      335.100000   9.880     39.43  2009
12  Radial Velocity       1      479.100000   3.880     97.28  2008
13  Radial Velocity       3     1078.000000   2.530     14.08  1996
14  Radial Velocity       3     2391.000000   0.540     14.08  2001
15  Radial Velocity       3    14002.000000   1.640     14.08  2009
16  Radial Velocity       1        4.230785   0.472     15.36  1995
17  Radial Velocity       5       14.651000   0.800     12.53  1996
18  Radial Velocity       5       44.380000   0.165     12.53  2004
19  Radial Velocity       5     4909.000000   3.530     12.53  2002

In [61]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

### Einige interessante Datenquellen
* Federal Statistical Office: https://www.bfs.admin.ch/bfs/en/home/statistics/catalogues-databases/data.html 
* OpenData: https://opendata.swiss/en/ 
* United Nations: http://data.un.org/ 
* World Health Organization: http://apps.who.int/gho/data/node.home 
* World Bank: https://data.worldbank.org/ 
* Kaggle: https://www.kaggle.com/datasets 
* Cern: http://opendata.cern.ch/
* Nasa: https://data.nasa.gov/ 
* FiveThirtyEight: https://github.com/fivethirtyeight/data

## Aggregieren und Gruppieren von Daten in Pandas

### Einfache Aggregation in Pandas
* Wie bei einem eindimensionalen NumPy-Array geben die Aggregate für eine Pandas "Serie" einen einzelnen Wert zurück.
* Für einen `DataFrame` geben die Aggregate standardmäßig Ergebnisse innerhalb jeder Spalte zurück.
* Pandas `Series` und `DataFrames` enthalten alle gängigen NumPy-Aggregate.
 * Zusätzlich gibt es eine komfortable Methode `describe()`, die mehrere allgemeine Aggregate für jede Spalte berechnet und das Ergebnis zurückgibt

In [58]:
rng = np.random.RandomState(3)
ser = pd.Series(rng.rand(5))
ser

0    0.550798
1    0.708148
2    0.290905
3    0.510828
4    0.892947
dtype: float64

In [59]:
ser.sum()

2.9536250236509423

In [60]:
ser.mean()

0.5907250047301884

In [61]:
df = pd.DataFrame({'A': rng.rand(5), 'B': rng.rand(5)})
df

          A         B
0  0.896293  0.029876
1  0.125585  0.456833
2  0.207243  0.649144
3  0.051467  0.278487
4  0.440810  0.676255

In [62]:
df.mean()

A    0.344280
B    0.418119
dtype: float64

In [62]:
df.mean(axis='columns')

0    5.00
1    4.25
2    5.00
dtype: float64

In [64]:
df.describe()

              A         B
count  5.000000  5.000000
mean   0.344280  0.418119
std    0.341461  0.270062
min    0.051467  0.029876
25%    0.125585  0.278487
50%    0.207243  0.456833
75%    0.440810  0.649144
max    0.896293  0.676255

### Split, Apply, Combine
* _Split_: Aufteilen und Gruppieren eines DataFrame in Abhängigkeit vom Wert des angegebenen Schlüssels
* _Apply_: Eine Funktion, normalerweise ein Aggregat, eine Transformation oder eine Filterung, innerhalb der einzelnen Gruppen anwenden
* _Combine_: Die Ergebnisse dieser Operationen in einem Ausgabe-Array zusammenführen

### Das `GroupBy` Object
* Die Methode `groupBy()` gibt ein `DataFrameGroupBy` zurück: Es ist eine spezielle Ansicht des `DataFrame`.
 * Hilft dabei, Informationen über die Gruppen zu erhalten, führt aber keine eigentlichen Berechnungen durch, bis die Aggregation angewendet wird ("lazy evaluation", d.h. nur bei Bedarf auswerten)
 * Wendet ein Aggregat auf dieses `DataFrameGroupBy` Objekt an: Dies führt die entsprechenden Anwendungs-/Verknüpfungsschritte durch, um das gewünschte Ergebnis zu erzielen.
   * Sie können jede Pandas- oder NumPy-Aggregationsfunktion anwenden.
 * Andere wichtige Operationen, die von einem `GroupBy` zur Verfügung gestellt werden, sind _filter_, _transform_ und _apply_.

In [65]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 'data': range(1,7)})
df

  key  data
0   A     1
1   B     2
2   C     3
3   A     4
4   B     5
5   C     6

In [66]:
groupby_key = df.groupby('key')
groupby_key.groups

{'A': Int64Index([0, 3], dtype='int64'),
 'B': Int64Index([1, 4], dtype='int64'),
 'C': Int64Index([2, 5], dtype='int64')}

In [67]:
df.groupby('key').sum()

     data
key
A       5
B       7
C       9

### Column Indexing and Iterating Over Groups
* The `GroupBy`-Objekt unterstützt die Spaltenindizierung auf die gleiche Weise wie der `DataFrame` und gibt ein modifiziertes `GroupBy`-Objekt zurück.
* The `GroupBy`-Objekt unterstützt auch die direkte Iteration über die Gruppen und gibt jede Gruppe als Serie oder `DataFrame` zurück.

In [63]:
planets.groupby('method')

In [64]:
planets.groupby('method')['orbital_period']

In [65]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [71]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

### Aggregate, Filter, Transform, und Apply
* _Aggregate_: Die Methode `aggregate()` kann mehrere Aggregate auf einmal berechnen
* _Filter_: Mit der Methode `filter()` können Sie Daten auf der Grundlage von Gruppeneigenschaften ausschließen
 * _Hinweis_: `filter()` nimmt als Argument eine Funktion, die einen booleschen Wert zurückgibt, der angibt, ob die Gruppe die Filterung besteht
* _Transformation_: Während die Aggregation eine reduzierte Version der Daten zurückgeben muss, kann `transform()` eine transformierte Version der vollständigen Daten zur Rekombination zurückgeben (was bedeutet, dass wir immer noch die gleiche Anzahl von Einträgen vor und nach der Transformation haben)
* _Apply_: Mit der Methode `apply()` kann man eine beliebige Funktion auf die Gruppenergebnisse (oder sogar auf `DataFrame` im Allgemeinen) anwenden. Die beliebige Funktion sollte einen `DataFrame` nehmen und entweder ein Pandas-Objekt oder einen Skalar zurückgeben

In [66]:
rng = np.random.RandomState(4)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6),
                   'price': ['$ 123.00', '$ 112.00', '$ 123.00', '$ 12.32', '$ 14.32', '$ 0.123']})
df

  key  data1  data2     price
0   A      0      7  $ 123.00
1   B      1      5  $ 112.00
2   C      2      1  $ 123.00
3   A      3      8   $ 12.32
4   B      4      7   $ 14.32
5   C      5      8   $ 0.123

In [73]:
df.groupby('key').aggregate(['min', np.median, max]) # Aggregation

    data1            data2
      min median max   min median max
key
A       0    1.5   3     7    7.5   8
B       1    2.5   4     5    6.0   7
C       2    3.5   5     1    4.5   8

In [74]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  0.707107
B    2.12132  1.414214
C    2.12132  4.949747

In [75]:
def filter_func(x):
    return x['data2'].std() > 1

In [76]:
df.groupby('key').filter(filter_func)

  key  data1  data2     price
1   B      1      5  $ 112.00
2   C      2      1  $ 123.00
4   B      4      7   $ 14.32
5   C      5      8   $ 0.123

In [77]:
def cleanup_price(x):
    return float(x[2:])

df["price"] = df["price"].apply(cleanup_price)
df

  key  data1  data2    price
0   A      0      7  123.000
1   B      1      5  112.000
2   C      2      1  123.000
3   A      3      8   12.320
4   B      4      7   14.320
5   C      5      8    0.123

In [78]:
df.groupby('key').std()

       data1     data2      price
key
A    2.12132  0.707107  78.262579
B    2.12132  1.414214  69.070190
C    2.12132  4.949747  86.887160

### Transformieren: ein Beispiel anhand von Verkaufsdaten
Quelle: http://pbpython.com/pandas_transform.html

In [70]:
sales = pd.read_excel("sales_transactions.xlsx")

In [71]:
sales.head()

   account           name  order       sku  quantity  unit price  ext price
0   383080       Will LLC  10001  B1-20000         7       33.69     235.83
1   383080       Will LLC  10001  S1-27722        11       21.12     232.32
2   383080       Will LLC  10001  B1-86481         3       35.99     107.97
3   412290  Jerde-Hilpert  10005  S1-06532        48       55.82    2679.36
4   412290  Jerde-Hilpert  10005  S1-82801        21       13.62     286.02

In [72]:
sales["cost"] = sales["quantity"] * sales["unit price"]

In [73]:
sales.head()

,account,name,order,sku,quantity,unit price,ext price,cost
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,235.83
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,232.32
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,107.97
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,2679.36
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,286.02

In [74]:
groupby_order = sales.groupby('order')
sales["order total"] = groupby_order["cost"].transform(np.sum)

In [75]:
sales.head()

,account,name,order,sku,quantity,unit price,ext price,cost,order total
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,235.83,576.12
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,232.32,576.12
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,107.97,576.12
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,2679.36,8185.49
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,286.02,8185.49

In [76]:
sales["percentage"] = sales["cost"] / sales["order total"] * 100

In [91]:
sales.groupby(['order', 'account', 'name'])[['order total']].aggregate(np.sum)

                             order total
order account name
10001 383080  Will LLC           1728.36
10005 412290  Jerde-Hilpert     40927.45
10006 218895  Kulas Inc         14897.96